{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"content":2,"slug":3},"\u003Ch1>jury duty\u003C/h1>\n\u003Ch2>September 14th, 2024\u003C/h2>\n\u003Cp>This week, I reported to the Brooklyn Supreme Courthouse for my first-ever jury duty assignment. To be honest, I was pretty excited to receive my summons in the mail. I couldn’t help but \u003Ca href=\"https://en.wikipedia.org/wiki/Jury_Duty_(2023_TV_series)\">Jury Duty\u003C/a> the show. It’s \u003Cem>so\u003C/em> good — I watched it twice last year, once with Emma and once with my entire family (I convinced them to binge the entire series on a family trip). Before watching the show I didn’t really have a sense of how the court system worked, so I was keen to see the details in real life.\u003C/p>\n\u003Cp>I can’t say much about the case itself, but one fascinating aspect of jury duty that I didn’t expect is the strange level of intimacy created between members of the same candidate pool. After being stuck in the same waiting area for hours, you’re called into the courtroom and about half of the group is called up to the jury box for questioning. At this point, the judge will question each and every candidate about their life — what’s their name? What do they do? How long have they lived in the area? Who do they live with? Have they, or any of their loved ones been a victim of a crime? A witness to a crime? Participated in a criminal jury before? The answers to the questions paint a silhouette of a person’s life, which is the intention during jury selection. I obviously didn’t \u003Cem>really\u003C/em> know these people, but it felt uncanny—almost intrusive—to know minute details about their affairs. Things like: “this person has lived in Prospect Heights for 15 years” or “they own their own restaurant” or “they have two kids in high school”. We were asked to come back a second day, and seeing my fellow jurors in the morning brought out a perplexing sense of \u003Cem>camaraderie\u003C/em>. I’m not sure why! Maybe it’s because we were in the same predicament: made to travel down to Downtown Brooklyn, stuck in jury duty, forced to skip work. Or maybe it’s because I felt like these people were no longer truly strangers.\u003C/p>\n\u003Cp>I ended up being excused by the judge on the second day. The trial was slated for two weeks, so I was mostly relieved, although a tiny part of me wishes I stayed on for the whole experience.\u003C/p>\n","juryduty"],"uses":{"params":["slug"]}}]}
